a = 8
b = 3
x = 2.5
y = -1.7

print("a =", a, "тип:", type(a))
print("b =", b, "тип:", type(b))
print("x=", x, "тип:", type(x))
print("y=", y, "тип:", type(y))
#-----------------------------
num1 = 22
num2 = 4
print("Сложение num1+num2 :", num1+num2)
print("Вычитание num1-num2 :", num1-num2)
print("Умножение num1*num2 :", num1*num2)
print("Деление num1/num2 :", num1/num2)
print("Целочисленное деление :", num1//num2)
print("Остаток от деления :", num1%num2)
print("Возведение в степень :", num1**num2)
#----------------------------
a = 10
b = 3
print("Результат деления a/b :", a/b)
print("Результат целочисленного деления a//b :", a//b)
print("Результат остатка от деления a%b :", a%b)

a = -10
b = 3
print("Результат деления a/b :", a/b)
print("Результат целочисленного деления a//b :", a//b)
print("Результат остатка от деления a%b :", a%b)

a = 10
b = -3
print("Результат деления a/b :", a/b)
print("Результат целочисленного деления a//b :", a//b)
print("Результат остатка от деления a%b :", a%b)
#--------------------------------------------------
print("5 + 3 * 2=", 5 + 3 * 2)
print("(5 + 3) * 2=", (5 + 3) * 2)
print("10 / 2 ** 2=", 10 / 2 ** 2)
#---------------------------------------------
count = 10
count += 5 # увеличиваем на 5
print(count)

count = 10
count -= 3 # уменьшаем на 3
print(count)

count = 10
count *= 2 # умножаем на 2
print(count)

count = 10
count /= 4 # делим на 3
print(count)

print("count=", count)
#-------------------------------

